app/views/persons/profile.html.erb

  <h3>Твиты</h3>
  <% if  @user.posts.empty? %>
---
SELECT  1 AS one FROM "posts"  WHERE "posts"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT "posts".* FROM "posts"  WHERE "posts"."user_id" = ?  [["user_id", 1]]