app/controllers/persons_controller.rb

  def read_writers
    @users = User.all - [current_user]
---
SELECT "users".* FROM "users"