app/controllers/persons_controller.rb

  def profile
    @user = (params.has_key?(:user_id) ? User.find(params[:user_id]) : current_user)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1

  def feed
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def add_writer
    if params.has_key? :user_id
      @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1

  def delete_writer
    if params.has_key? :user_id
      @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 3  ORDER BY "users"."id" ASC LIMIT 1

  def update
    @user = User.find(current_user.id)
    @user.update(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 6  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "avatar_content_type" = ?, "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = 1

  def add_post
    @post = Post.new
    @post.body = params[:post][:body]
    @post.save
---
INSERT INTO "posts" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "My first post\r\n"], ["created_at", "2014-06-08 13:19:02.719964"], ["updated_at", "2014-06-08 13:19:02.719964"]]

  def delete_post
    @post = Post.find(params[:post_id])
    @post.destroy
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 20]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 20]]