app/controllers/registrations_controller.rb

INSERT INTO "users" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "city", "created_at", "email", "encrypted_password", "name", "nic", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    User.create sign_up_params